import pandas as pd
import pytest
from pandas.core.interchange.dataframe_protocol import DataFrame


@pytest.fixture
def transactions_fixture() -> list:
    return [
        {
            "Дата операции": "11.01.2018 00:00:00",
            "Дата платежа": "13.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -94.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -94.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Транспорт",
            "MCC": 4121.0,
            "Описание": "Яндекс Такси",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 94.0,
        },
        {
            "Дата операции": "14.01.2018 21:52:23",
            "Дата платежа": "16.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -69.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -69.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Топливо",
            "MCC": 5541.0,
            "Описание": "Shell",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 69.0,
        },
        {
            "Дата операции": "19.01.2018 10:34:06",
            "Дата платежа": "20.01.2018",
            "Номер карты": "*5133",
            "Статус": "OK",
            "Сумма операции": -840.3,
            "Валюта операции": "RUB",
            "Сумма платежа": -840.3,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Ж/д билеты",
            "MCC": 4112.0,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 16,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 840.3,
        },
        {
            "Дата операции": "16.01.2018 21:21:22",
            "Дата платежа": "18.01.2018",
            "Номер карты": "*5133",
            "Статус": "OK",
            "Сумма операции": -149.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -149.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Сервис",
            "MCC": 7311.0,
            "Описание": "Avito",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 149.0,
        },
        {
            "Дата операции": "18.01.2018 19:19:09",
            "Дата платежа": "20.01.2018",
            "Номер карты": "*5133",
            "Статус": "OK",
            "Сумма операции": -124.9,
            "Валюта операции": "RUB",
            "Сумма платежа": -124.9,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Бургер Кинг",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 124.9,
        },
        {
            "Дата операции": "08.01.2018 14:21:23",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -250.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -250.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 4814.0,
            "Описание": "МТС",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 250.0,
        },
    ]


@pytest.fixture
def transactions_fixture_df() -> DataFrame:
    data = {
        "Дата операции": [
            "01.01.2023 10:00:00",
            "15.01.2023 11:00:00",
            "25.01.2023 12:00:00",
            "01.02.2023 13:00:00",
            "10.01.2023 14:00:00",
            "20.01.2023 15:00:00",
        ],
        "Категория": [
            "Еда",
            "Еда",
            "Еда",
            "Транспорт",
            "Развлечения",
            "Развлечения",
        ],
        "Сумма": [-100.5, -250.75, -150.0, -50.25, -300.0, -200.0],
    }
    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], dayfirst=True)
    return df


# @pytest.fixture
# def formatted_transactions_for_top(transactions_fixture):
#     """Подготавливает данные из transactions_fixture в формат, который ожидает функция top"""
#     formatted_data = []
#     for transaction in transactions_fixture:
#         date = transaction.get("Дата платежа")
#         amount = transaction.get("Сумма операции")
#         category = transaction.get("Категория")
#         description = transaction.get("Описание")
#         if date is not None and amount is not None:
#             formatted_data.append({
#                 "date": date,
#                 "amount": amount,
#                 "category": category,
#                 "description": description
#             })
#     return formatted_data
