from src.services import process_bank_search


def test_process_bank_search(transactions_fixture: list):
    result = process_bank_search(transactions_fixture, "Транспорт")
    assert result == (
        "[\n"
        "    {\n"
        '        "Дата операции": "11.01.2018 00:00:00",\n'
        '        "Дата платежа": "13.01.2018",\n'
        '        "Номер карты": "*7197",\n'
        '        "Статус": "OK",\n'
        '        "Сумма операции": -94.0,\n'
        '        "Валюта операции": "RUB",\n'
        '        "Сумма платежа": -94.0,\n'
        '        "Валюта платежа": "RUB",\n'
        '        "Кэшбэк": 0,\n'
        '        "Категория": "Транспорт",\n'
        '        "MCC": 4121.0,\n'
        '        "Описание": "Яндекс Такси",\n'
        '        "Бонусы (включая кэшбэк)": 1,\n'
        '        "Округление на инвесткопилку": 0,\n'
        '        "Сумма операции с округлением": 94.0\n'
        "    }\n"
        "]"
    )
