from src.services import process_bank_search


def test_process_bank_search(transactions_fixture: list):
    result = process_bank_search(transactions_fixture, "Транспорт")
    assert result == [
        {
            "Дата операции": "11.01.2018 00:00:00",
            "Дата платежа": "13.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -94.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -94.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Транспорт",
            "MCC": 4121.0,
            "Описание": "Яндекс Такси",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 94.0
        }
    ]
